let b = [
  "১৩০ মহেগান এভিনিউয়ে বাড়ি",
  "অতিনবতারা পর্যবেক্ষণের ইতিহাস",
  "অনসূয়া",
  "অরুণাচলেশ্বর মন্দির",
  "অলাতচক্র (চলচ্চিত্র)",
  "অসুরবানীপাল (ভাস্কর্য)",
  "অ্যাক্রোস দ্য ওয়ে",
  "অ্যাডামস নদী",
  "অ্যাবে মিলস মসজিদ",
  "আনাতকাবির",
  "আবদুর রহিম আলহাজ মুহাম্মদ",
  "আমাক আগ্নেয়গিরি",
  "আমান্ডা পুরস্কার",
  "আমিবা",
  "আল-আজহার মসজিদ",
  "আল-জাররাহ ইবনে আবদুল্লাহ",
  "আল-রিসালাহ আল-যাহাবিইয়াহ",
  "ইউ উইল নেভার ইট লাঞ্চ ইন দিস টাউন এগেইন",
  "ইজ্জউদ্দিন আল-কাসসাম",
  "ইয়ারমুকের যুদ্ধ",
  "ঈশ্বরচন্দ্র বিদ্যাসাগর",
  "উইলিয়াম চার্লস ওসমান হিল",
  "এইভারি চূড়া বাতিঘর",
  "এথেলম",
  "এন্টিমেট্রিক বৈদ্যুতিক নেটওয়ার্ক",
  "এব্বর গর্জ",
  "এসএমএস কমেট",
  "ওয়াল্ট হুইটম্যান",
  "ওয়েলার হল",
  "ওল্ড ম্যান অব হোয়",
  "ওশেন ভিলেজ ম্যারিনা, জিব্রাল্টার",
  "ওসাইরিসের অতিকথা",
  "কথাসাহিত্যে বৃহস্পতি গ্রহ",
  "কল্পবিজ্ঞানে মহাকাশ ভ্রমণ",
  "কুরুশ ইয়াঘমই",
  "কেপলার-৪বি",
  "কেপলার-৫",
  "কেপলার-৫বি",
  "কেপলার-৬",
  "কেপলার-৭",
  "কেপলার-৮",
  "কেপলার-৯বি",
  "কেপলার-১১",
  "কেপলার-১১বি",
  "কেপলার-১১সি",
  "কোডেক্স কইস্লিনিয়ানুস",
  "কোদণ্ডরাম মন্দির, ওন্টিমিট্ট",
  "ক্রিস্তিয়ানো রোনালদো",
  "খাপলু প্রাসাদ",
  "গাবুন ভাইপার",
  "গিয়াইলো বিমানবন্দর, ডাগালি",
  "গিরদাপ",
  "গেটওয়ে অব ইন্ডিয়া",
  "গ্রিল (অলঙ্কার)",
  "গ্রেট সল্ট লেক",
  "গ্লেন পি. রবিনসন",
  "চঞ্চল কুমার মজুমদার",
  "চট্টগ্রাম বিশ্ববিদ্যালয়",
  "চট্টগ্রাম বিশ্ববিদ্যালয় জাদুঘর",
  "চন্দ্র বিভাজন",
  "চার্লস রেডেফার",
  "ছায়াপথীয় বাসযোগ্য ক্ষেত্র",
  "জীবন ও রাজনৈতিক বাস্তবতা",
  "টিকল কক ব্রিজ",
  "টিনটিনহাল বাগান",
  "ট্রেজারস হাউজ",
  "তিলোত্তমা",
  "থিক কুয়াং ডুক",
  "থিবি",
  "দক্ষিণ এশীয় নদীর ডলফিন",
  "দি এন্ডলেস রিভার",
  "দেশি সারস",
  "দ্য মারমেইড (১৯১০-এর চলচ্চিত্র)",
  "নর্মা (তারামণ্ডল)",
  "নেফেরিরকারের পিরামিড",
  "পশ্চিমাঞ্চলীয় সবুজ মাম্বা",
  "পাক (প্রাকৃতিক উপগ্রহ)",
  "ফরেস্ট কোবরা",
  "ফ্রিডম ফ্রম ফিয়ার (চিত্রকর্ম)",
  "ফ্রিডা পিন্টো",
  "বড়া গুম্বদ",
  "বিয়ের নাচ",
  "বৈয়ু মন্দির",
  "মসজিদ আল-উমরি আল-কাবির",
  "মায়া ডেরেন",
  "মেটিস (প্রাকৃতিক উপগ্রহ)",
  "যোগিনী মন্দির",
  "রঘুনাথ মন্দির",
  "শহীদুল জহির",
  "শিরোনামহীন",
  "শ্রী টেমাসেক",
  "সংস্কৃতিতে সমুদ্র",
  "সর্বত মঙ্গল রাধে বিনোদিনী রাই",
  "স্কাথি (প্রাকৃতিক উপগ্রহ)",
  "স্টেপিস",
  "হাসান আল-খাররাত",
  "হাসিব আহসান",
  "হিলোকা (নদী)",
  "হিস্ট্রি অব অ্যানিমেলস",
  "হেবরন কাঁচ",
];
let c = [];
let list = document.querySelectorAll("ol li");
let p = [];
for (i in list) {
  let title = list[i].getElementsByTagName("a")[0].title;
  if (b.includes(title)) {
    c.push(title);
    p.push([title, list[i].getElementsByTagName("a")[10].title]);
  }
}
for (i in b) {
  if (!c.includes(b[i])) {
    p.push([b[i], ""]);
  }
}

//part 2
const api = new mw.Api();
const today = new Date();
function usrLstContribution(username, callback) {
  var params = {
    action: "query",
    format: "json",
    list: "usercontribs",
    formatversion: "2",
    uclimit: "1",
    ucuser: username,
    ucnamespace: "*",
  };
  api
    .get(params)
    .then(function (data) {
      var lastContribution = data.query.usercontribs[0].timestamp;
      var dateday = countDay(lastContribution);
      var result = {
        date: dateday.date,
        days: dateday.days,
      };
      callback(result);
    })
    .fail(function (error) {
      console.error(error);
    });
}
let data = [
  ["বড়া গুম্বদ", "ব্যবহারকারী:Jonoikobangali"],
  ["নেফেরিরকারের পিরামিড", "ব্যবহারকারী:Jonoikobangali"],
  ["আনাতকাবির", "ব্যবহারকারী:Mehedi Abedin"],
  ["চট্টগ্রাম বিশ্ববিদ্যালয় জাদুঘর", "ব্যবহারকারী:Moheen"],
  ["১৩০ মহেগান এভিনিউয়ে বাড়ি", "ব্যবহারকারী:Moheen"],
  ["অরুণাচলেশ্বর মন্দির", "ব্যবহারকারী:Jonoikobangali"],
  ["অ্যাবে মিলস মসজিদ", "ব্যবহারকারী:Moheen"],
  ["আল-আজহার মসজিদ", "ব্যবহারকারী:Moheen"],
  ["এইভারি চূড়া বাতিঘর", "ব্যবহারকারী:Moheen"],
  ["ওয়েলার হল", "ব্যবহারকারী:Moheen"],
  ["কোদণ্ডরাম মন্দির, ওন্টিমিট্ট", "ব্যবহারকারী:Moheen"],
  ["খাপলু প্রাসাদ", "ব্যবহারকারী:Moheen"],
  ["গেটওয়ে অব ইন্ডিয়া", "ব্যবহারকারী:Moheen"],
  ["টিকল কক ব্রিজ", "ব্যবহারকারী:Moheen"],
  ["এন্টিমেট্রিক বৈদ্যুতিক নেটওয়ার্ক", "ব্যবহারকারী:Moheen"],
  ["গিয়াইলো বিমানবন্দর, ডাগালি", "ব্যবহারকারী:Moheen"],
  ["গ্লেন পি. রবিনসন", "ব্যবহারকারী:Moheen"],
  ["চার্লস রেডেফার", "ব্যবহারকারী:Moheen"],
  ["অ্যাডামস নদী", "ব্যবহারকারী:Moheen"],
  ["আমাক আগ্নেয়গিরি", "ব্যবহারকারী:Moheen"],
  ["হিলোকা (নদী)", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["এব্বর গর্জ", "ব্যবহারকারী:Moheen"],
  ["ওল্ড ম্যান অব হোয়", "ব্যবহারকারী:Moheen"],
  ["গ্রেট সল্ট লেক", "ব্যবহারকারী:Moheen"],
  ["ইজ্জউদ্দিন আল-কাসসাম", "ব্যবহারকারী:Moheen"],
  ["শহীদুল জহির", "ব্যবহারকারী:Moheen"],
  ["কল্পবিজ্ঞানে মহাকাশ ভ্রমণ", "ব্যবহারকারী:Jonoikobangali"],
  ["কথাসাহিত্যে বৃহস্পতি গ্রহ", "ব্যবহারকারী:Jonoikobangali"],
  ["জীবন ও রাজনৈতিক বাস্তবতা", "ব্যবহারকারী:Moheen"],
  ["ওয়াল্ট হুইটম্যান", "ব্যবহারকারী:RUBEL SHAIKH"],
  ["হিস্ট্রি অব অ্যানিমেলস", "ব্যবহারকারী:Ashiq Shawon"],
  ["ইউ উইল নেভার ইট লাঞ্চ ইন দিস টাউন এগেইন", "ব্যবহারকারী:Moheen"],
  ["কোডেক্স কইস্লিনিয়ানুস", "ব্যবহারকারী:Moheen"],
  ["অ্যাক্রোস দ্য ওয়ে", "ব্যবহারকারী:Moheen"],
  ["মায়া ডেরেন", "ব্যবহারকারী:Moheen"],
  ["ফ্রিডা পিন্টো", "ব্যবহারকারী:Moheen"],
  ["দি এন্ডলেস রিভার", "ব্যবহারকারী:Moheen"],
  ["কুরুশ ইয়াঘমই", "ব্যবহারকারী:Moheen"],
  ["শিরোনামহীন", "ব্যবহারকারী:Moheen"],
  ["ফরেস্ট কোবরা", "ব্যবহারকারী:Atudu"],
  ["দক্ষিণ এশীয় নদীর ডলফিন", "ব্যবহারকারী:Tanbiruzzaman"],
  ["উইলিয়াম চার্লস ওসমান হিল", "ব্যবহারকারী:Moheen"],
  ["আল-রিসালাহ আল-যাহাবিইয়াহ", "ব্যবহারকারী:Moheen"],
  ["গাবুন ভাইপার", "ব্যবহারকারী:Moheen"],
  ["চঞ্চল কুমার মজুমদার", "ব্যবহারকারী:বাক্যবাগীশ"],
  ["নর্মা (তারামণ্ডল)", "ব্যবহারকারী:Jonoikobangali"],
  ["ছায়াপথীয় বাসযোগ্য ক্ষেত্র", "ব্যবহারকারী:Jonoikobangali"],
  ["স্কাথি (প্রাকৃতিক উপগ্রহ)", "ব্যবহারকারী:FaysaLBinDaruL"],
  ["কেপলার-৭", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["কেপলার-৮", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["কেপলার-৯বি", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["কেপলার-১১", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["কেপলার-১১বি", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["কেপলার-১১সি", "ব্যবহারকারী:মোহাম্মদ মারুফ"],
  ["অতিনবতারা পর্যবেক্ষণের ইতিহাস", "ব্যবহারকারী:Moheen"],
  ["আমিবা", "ব্যবহারকারী:Moheen"],
  ["অনসূয়া", "ব্যবহারকারী:Moheen"],
  ["তিলোত্তমা", "ব্যবহারকারী:Moheen"],
  ["চন্দ্র বিভাজন", "ব্যবহারকারী:Moheen"],
  ["যোগিনী মন্দির", "ব্যবহারকারী:Jonoikobangali"],
  ["ওসাইরিসের অতিকথা", "ব্যবহারকারী:Jonoikobangali"],
  ["থিক কুয়াং ডুক", "ব্যবহারকারী:Moheen"],
  ["এথেলম", "ব্যবহারকারী:Moheen"],
  ["ঈশ্বরচন্দ্র বিদ্যাসাগর", "ব্যবহারকারী:Che12Guevara"],
  ["সংস্কৃতিতে সমুদ্র", "ব্যবহারকারী:Jonoikobangali"],
  ["আমান্ডা পুরস্কার", "ব্যবহারকারী:Moheen"],
  ["গ্রিল (অলঙ্কার)", "ব্যবহারকারী:Moheen"],
  ["চট্টগ্রাম বিশ্ববিদ্যালয়", "ব্যবহারকারী:শিমুল ধর"],
  ["গিরদাপ", "ব্যবহারকারী:Moheen"],
  ["ক্রিস্তিয়ানো রোনালদো", "ব্যবহারকারী:Maksud"],
  ["হাসিব আহসান", "ব্যবহারকারী:Borhan"],
  ["ওশেন ভিলেজ ম্যারিনা, জিব্রাল্টার", "ব্যবহারকারী:Moheen"],
  ["অলাতচক্র (চলচ্চিত্র)", ""],
  ["অসুরবানীপাল (ভাস্কর্য)", ""],
  ["আবদুর রহিম আলহাজ মুহাম্মদ", ""],
  ["আল-জাররাহ ইবনে আবদুল্লাহ", ""],
  ["ইয়ারমুকের যুদ্ধ", ""],
  ["এসএমএস কমেট", ""],
  ["কেপলার-৪বি", ""],
  ["কেপলার-৫", ""],
  ["কেপলার-৫বি", ""],
  ["কেপলার-৬", ""],
  ["টিনটিনহাল বাগান", ""],
  ["ট্রেজারস হাউজ", ""],
  ["থিবি", ""],
  ["দেশি সারস", ""],
  ["দ্য মারমেইড (১৯১০-এর চলচ্চিত্র)", ""],
  ["পশ্চিমাঞ্চলীয় সবুজ মাম্বা", ""],
  ["পাক (প্রাকৃতিক উপগ্রহ)", ""],
  ["ফ্রিডম ফ্রম ফিয়ার (চিত্রকর্ম)", ""],
  ["বিয়ের নাচ", ""],
  ["বৈয়ু মন্দির", ""],
  ["মসজিদ আল-উমরি আল-কাবির", ""],
  ["মেটিস (প্রাকৃতিক উপগ্রহ)", ""],
  ["রঘুনাথ মন্দির", ""],
  ["শ্রী টেমাসেক", ""],
  ["সর্বত মঙ্গল রাধে বিনোদিনী রাই", ""],
  ["স্টেপিস", ""],
  ["হাসান আল-খাররাত", ""],
  ["হেবরন কাঁচ", ""],
];
function countDay(date) {
  var diff = today - new Date(date);
  var diffdate = new Date(date);
  var monthArray = [
    "জানুয়ারি",
    "ফেব্রুয়ারি",
    "মার্চ",
    "এপ্রিল",
    "মে",
    "জুন",
    "জুলাই",
    "আগস্ট",
    "সেপ্টেম্বর",
    "অক্টোবর",
    "নভেম্বর",
    "ডিসেম্বর",
  ];
  var diffObj = {
    date:
      translateNumbers(diffdate.getDate()) +
      " " +
      monthArray[diffdate.getMonth()] +
      ", " +
      translateNumbers(diffdate.getFullYear()),
    days: Math.floor(diff / (1000 * 60 * 60 * 24)),
  };
  return {
    days: diffObj.days,
    date: diffObj.date,
  };
}
function translateNumbers(number) {
  var num = number.toString();
  var result = "";
  result = num
    .replace(/0/gi, "০")
    .replace(/1/gi, "১")
    .replace(/2/gi, "২")
    .replace(/3/gi, "৩")
    .replace(/4/gi, "৪")
    .replace(/5/gi, "৫")
    .replace(/6/gi, "৬")
    .replace(/7/gi, "৭")
    .replace(/8/gi, "৮")
    .replace(/9/gi, "৯");
  return result;
}
let i = 0;
let j = 0;
let wikitext = ``;
function loop(callback, i) {
  if (i < 100) {
    if (data[i][1]) {
      usrLstContribution(
        data[i][1].replace("ব্যবহারকারী:", ""),
        function (usrdata) {
          wikitext += `|${i + 1}||[[${data[i][0]}]]||[[${
            data[i][1]
          }|]]||${translateNumbers(usrdata.days)}
  |-
  `;
          i++;
          loop(callback, i);
        }
      );
    } else {
      wikitext += `|${i + 1}||[[${data[i][0]}]]|| || 
  |-
  `;
      i++;
      loop(callback, i);
    }
    console.log(data[i][0]);
  } else {
    callback(wikitext);
  }
}
loop((data) => {
  console.log(data);
}, i);