mw.loader.using(["jquery.ui"]).then(function () {
  (function ($) {
    /*
     ****************************************
     *** ব্যবহারকারী:মোহাম্মদ মারুফ/বার্তাপ্রদান.js: বার্তাপ্রদান মডিউল
     ****************************************
     * Mode of invocation:     ট্যাগযুক্ত পাতা থেকে পাতা তৈরিকারককে বার্তা প্রদান
     * Active on:              মূল নামস্থান
     * Config directives in:   ব্যবহারকারী:মোহাম্মদ মারুফ/বার্তাপ্রদান.js
     * creator:                মোহাম্মদ মারুফ
     * mentored by:            MdsShakil
     * version:                3.0.1
     * new features:           faster, ask you if it thinks user is not active
     */
    // dependencies
    const api = new mw.Api();
    const pagename = mw.config.get("wgPageName").replace(/_/g, " ");
    const skin = mw.config.get("skin");
    const today = new Date();
    mw.loader.load(
      "/w/index.php?title=ব্যবহারকারী:মোহাম্মদ মারুফ/বার্তাপ্রদান.css&action=raw&ctype=text/css",
      "text/css"
    );
    var area = skin === "minerva" ? "p-tb" : "p-cactions";
    //সমস্যা
    var problems = [
      /* "COI", */ // প্রয়োজন নেই
      /* "expert-subject", */ // প্রয়োজন নেই
      /* "Merge from", */ // প্রয়োজন নেই
      /* "Merge to", */ // প্রয়োজন নেই
      /* "ইতিহাস একীকরণ", প্রয়োজন নেই, প্রশাশকের কাজ*/
      /*"নতুন অপর্যালোচিত নিবন্ধ", প্রয়োজন নেই, পর্যালোচকের কাজ */
      /* "ব্যবহৃত হচ্ছে" , প্রয়োজন নেই*/
      "Close paraphrasing",
      "Hoax",
      "In-universe",
      "Peacock",
      "Plot",
      "Recentism",
      "Too few opinions",
      "Weasel",
      "context",
      "fansite",
      "tense",
      "অ-উন্মুক্ত",
      "অতিরিক্ত অনুচ্ছেদসমূহ",
      "অতিরিক্ত সংযোগ",
      "অনির্ভরযোগ্য তথ্যসূত্র",
      "অনুচ্ছেদসমূহ",
      "অনুলিপি প্রতিলেপন",
      "অনুলিপি সম্পাদনা",
      "অসংযুক্ত",
      "অসংলগ্ন",
      "আত্মজীবনী",
      "আরও পাদটীকা",
      "উদ্ধৃতিদান শৈলী",
      "উল্লেখযোগ্যতা",
      "উৎসহীন",
      "একটি উৎস",
      "একীকরণ",
      "কম সংযুক্ত",
      "কমসংযুক্ত",
      "কারিগরি পরিভাষার আধিক্য",
      "কাল্পনিক",
      "খালি ইউআরএল পরিষ্কারকরণ",
      "খুব দীর্ঘ",
      "গদ্য",
      "ছোট নিবন্ধ",
      "জী-ব্য-জী উৎসহীন",
      "জী-ব্য-জী তথ্যসূত্র",
      "নিরপেক্ষতা",
      "পরিষ্করণ",
      "পরিষ্করণ-পুনঃসংগঠন",
      "পাদটীকা নেই",
      "পুরোটাই দৃশ্যপট",
      "প্রাথমিক উৎস",
      "বর্ণনা ভঙ্গি",
      "বহিঃসংযোগসমূহ",
      "বাংলা নয়",
      "বিজ্ঞাপন",
      "বিতর্কিত",
      "বিভ্রান্তিকর",
      "বিষয়শ্রেণী উন্নয়ন",
      "বিষয়শ্রেণীহীন",
      "বৈশ্বিক দৃষ্টিভঙ্গি",
      "ভাষা সম্প্রসারণ",
      "ভূমিকাংশ অতি দীর্ঘ",
      "ভূমিকাংশ অনুপস্থিত",
      "ভূমিকাংশ খুবই সংক্ষিপ্ত",
      "ভূমিকাংশ পুনর্লিখন",
      "মেয়াদউত্তীর্ণ",
      "মৌলিক গবেষণা",
      "যান্ত্রিক অনুবাদ",
      "রচনা সংশোধন",
      "রচনানুগ",
      "সংযোগহীন",
      "সূত্র উন্নতি",
      "স্বপ্রকাশিত",
      "হালনাগাদ",
      "অসম্পূর্ণ",
      "জীববিজ্ঞান-অসম্পূর্ণ",
      "রসায়ন-অসম্পূর্ণ",
      "বিজ্ঞান-অসম্পূর্ণ",
      "বিষমচাক্রিক-অসম্পূর্ণ",
      "কম্পিউটার বিজ্ঞান-অসম্পূর্ণ",
      "গণিত-অসম্পূর্ণ",
      "অসম্পূর্ণ-জীবনী",
      "ভৌগোলিক অবস্থান-অসম্পূর্ণ",
      "প্রাণী অসম্পূর্ণ",
      "চিকিৎসা বিজ্ঞান-অসম্পূর্ণ",
      "টেলিভিশন ধারাবাহিক অসম্পূর্ণ",
      "চলচ্চিত্র-অসম্পূর্ণ",
      "ধর্ম-অসম্পূর্ণ",
      "এভিয়েশন-অসম্পূর্ণ",
      "খাদ্য অসম্পূর্ণ",
      "ওয়েবসাইট অসম্পূর্ণ",
      "অ্যানিমে-অসম্পূর্ণ",
    ];
    //সমাধান
    var problemDes = {
      "Close paraphrasing": {
        des: "নিবন্ধটিতে অনেক কপিরাইট যুক্ত উক্তি দ্বারা লেখা হয়েছে",
        soln: "কপিরাইটযুক্ত লেখা সমূহ সরিয়ে ফেলুন এবং নিজের ভাষায় লিখুন",
      },
      Hoax: {
        des: "'''এই নিবন্ধের বা নিবন্ধের অনুচ্ছেদের সত্যতা প্রশ্নবিদ্ধ।''' এটি বিশ্বাস করা হয়, এই নিবন্ধের সম্পূর্ণ বা কিছু অংশ সম্ভবত [[উইকিপিডিয়া:ধোঁকাবাজি করবেন না|ধোঁকাবাজি]] হতে পারে",
        soln: `নিবন্ধটির বিষয়বস্তুর দাবি প্রতিষ্ঠা করার জন্য [[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য উৎস]] যুক্ত করুন অথবা নিবন্ধটির আলাপ পাতায় মন্তব্য করুন।`,
      },
      "In-universe": {
        des: "নিবন্ধটির বিষয় কাল্পনিক এবং একটি অ-কাল্পনিক দৃষ্টিকোণ থেকে পুনঃলিখন প্রয়োজন",
        soln: "নিবন্ধটির বিষয়বস্তু আরও স্পষ্টভাবে ব্যাখ্যা করতে এবং অ-কাল্পনিক দৃষ্টিকোণ প্রদান করতে এটিকে পুনরায় লিখতে সহায়তা করুন।",
      },
      Peacock: {
        des: "নিবন্ধটিতে আত্মশ্লাঘাকারী পদ থাকতে পারে যা শুধু তথ্য যোগ ছাড়াও অন্য বিষয়কে প্রচার করছে বলে প্রতীয়মান হয়",
        soln: "'''বিষয়বস্তুর তাৎপর্য ঘোষনা বা প্রচার করে এমন শব্দসমূহ অপসারণ বা প্রতিস্থাপন করুন'''। বিষয়বস্তু সম্পর্কে কেবল প্রকৃত সত্য তুলে ধরুন এবং স্বীকৃতি উদ্ধৃতি উল্লেখের মাধ্যমে গুরুত্ব নির্দেশ করুন",
      },
      Plot: {
        des: "নিবন্ধটির প্লট সারসংক্ষেপ অত্যন্ত দীর্ঘ। নিবন্ধটির সারাংশ '''[[উইকিপিডিয়া:How to write a plot summary|খুবই দীর্ঘ]] বা [[উইকিপিডিয়া:How to write a plot summary|অতিমাত্রায় বিশদভাবে বর্ণিত]] যা পাঠকের ধৈর্যের বিচ্যুতির কারণ হতে পারে'''",
        soln: "দয়া করে অপ্রয়োজনীয় ও অপেক্ষাকৃত কম গুরুত্বপূর্ণ বর্ণনা বাদ দিয়ে এবং একে আরও সংক্ষিপ্ত করে নিবন্ধটি উন্নয়নে সহায়তা করুন। আপনি চাইলে নিবন্ধটিকে বিষয়বস্তু আকারে ভাগ করে সেখানে এই তথ্যগুলো যোগ করতে পারেন।",
      },
      Recentism: {
        des: "নিবন্ধটিতে তির্যকভাবে সাম্প্রতিক ঘটনার নির্দেশ করছে বলে ধরণা করা হচ্ছে। নিবন্ধে বা এর অনুচ্ছেদে '''[[উইকিপিডিয়া:Recentism|সাম্প্রতিক ঘটনাবলির]] উল্লেখ থাকতে পারে।''' ",
        soln: "এই ঘটনাসমূহকে ঐতিহাসিক দৃষ্টিকোণ থেকে উল্লেখের চেষ্টা করুন এবং নিবন্ধটি পুনরায় লিখুন",
      },
      "Too few opinions": {
        des: "নিবন্ধটিতে সকল গুরুত্বপূর্ণ দৃষ্টিভঙ্গি নাও অন্তর্ভুক্ত করতে পারে। এই নিবন্ধে উল্লেখিত উদাহরণ এবং পরিপ্রেক্ষিতসমুহে সকল '''[[উইকিপিডিয়া:WikiProject Countering systemic bias|গুরুত্বপূর্ণ মতামত অন্তর্ভূক্ত করা হয়নি]]'''",
        soln: `নিবন্ধটির মানোন্নয়ন করুন অথবা নিবন্ধটির আলাপ পাতায় আলোচনা করুন`,
      },
      Weasel: {
        des: "নিবন্ধটিতে কিছু অগ্রহনযোগ্য শব্দ বা অস্পষ্ট বাক্যাংশ যা প্রায়শই [[উইকিপিডিয়া:Neutral point of view|পক্ষপাতমূলক]] বা [[উইকিপিডিয়া:যাচাইযোগ্যতা|যাচাই করা যায় না]] এমন তথ্য রয়েছে, যা উইকিপিডিয়ার রচনাশৈলী মতে ঠিক নয়",
        soln: "এই ধরণের বিবৃতি [[উইকিপিডিয়া:Avoid weasel words|স্পষ্ট বা অপসারণ]] করুন",
      },
      context: {
        des: "নিবন্ধটিতে প্রসঙ্গ যাচাই করার জন্য যথেষ্ট পরিমান তথ্য নেই",
        soln: "[[উইকিপিডিয়া:উৎকৃষ্ট নিবন্ধ লিখন|উইকিপিডিয়ার রচনাশৈলি]] অনুসারে, নিবন্ধটির উন্নয়ন করুন। তা না হলে এটি অপসারণের জন্য মনোনীত হতে পারে",
      },
      fansite: {
        des: "নিবন্ধটি '''[[উইকিপিডিয়া:নিরপেক্ষ দৃষ্টিভঙ্গি|নিরপেক্ষ দৃষ্টিকোণ]] থেকে লেখা হয়নি বরং একজন [[উইকিপিডিয়া:ভক্তপাতদুষ্ট|ভক্তের দৃষ্টিকোণ]] থেকে লেখা হয়েছে",
        soln: "নিবন্ধটিকে [[উইকিপিডিয়া:নিবন্ধ ত্রুটি দূরীকরণ|পরিষ্করণ]] করে পুনঃলিখনের মাধ্যমে এর [[:বিষয়শ্রেণী:উইকিপিডিয়া রচনাশৈলী নির্দেশনা|মানোন্নয়ন]] করুন এবং নিরপেক্ষ দৃষ্টিভঙ্গি থেকে তথ্যসূত্রসমূহ উল্লেখ করুন",
      },
      tense: {
        des: "এই নিবন্ধটিতে '''উইকিপিডিয়ার রচনাশৈলী অনুসারে [[উইকিপিডিয়া:উৎকৃষ্ট_নিবন্ধ_লিখন#পরিষ্কার,_সুনির্দিষ্ট_এবং_সঠিক_পদের_ব্যবহার|সঠিক ক্রিয়ার কাল ও পদবিন্যস]] ব্যবহৃত হয়নি''' ।",
        soln: "[[উইকিপিডিয়া:রচনা সংশোধন|রচনা সংশোধন]] করে অতীত, বর্তমান বা ভবিষ্যতে ঘটে যাওয়া ঘটনাসমূহ সঠিক ক্রিয়ার কাল অনুসারে লিখুন",
      },
      "অ-উন্মুক্ত": {
        des: "নিবন্ধটিতে [[উইকিপিডিয়া:কপিরাইট|কপিরাইটকৃত]] উপাদানের অত্যাধিক অথবা অনুপযুক্ত ব্যবহার রয়েছে",
        soln: "[[উইকিপিডিয়া:মুক্ত-নয় এমন উপাদান নির্ণায়ক|নীতিমালা]] এবং [[উইকিপিডিয়া:মুক্ত নয় এমন উপাদান|নির্দেশনাবলী]] অনুসরণ করে নিবন্ধে কপিরাইটকৃত উপাদানের ব্যবহার প্রত্যাহার করুন এবং যেকোন রকমের লঙ্ঘন সংশোধন করুন। নিবন্ধের আলাপের পাতায় এ সম্পর্কে বিস্তারিত থাকতে পারে। আপনি যদি এ বিষয়ে একমত না হন, নিবন্ধটির আলাপ পাতায় আপনার যুক্তি উপস্থাপন করুন",
      },
      "অতিরিক্ত অনুচ্ছেদসমূহ": {
        des: "নিবন্ধটিতে অতিরিক্ত অনুচ্ছেদসমূহ রয়েছে, এর মধ্যে কিছু অপসারণ করা উচিত",
        soln: "সদৃশ্য অনুচ্ছেদগুলিকে একত্রিত করুন এবং অপ্রয়োজনীয় উপশিরোনামগুলিকে অপসারণ করুন। যেমন: নিবন্ধটি একটি ব্যক্তির জীবনী হলে অনুচ্ছেদগুলি ব্যক্তির জীবনীর বিভিন্ন অংশগুলি হিসেবে একত্রিত করা উচিৎ। জন্মতারিখ, জন্মস্থান, পিতা, মাতা, বেড়ে ওঠা ইত্যাদি বিষয়গুলো একটি তথ্যছক বা একটি অনুচ্ছেদ (জন্ম) এ একত্রিত করে লেখা উচিৎ। অনুরূপে আপনার তৈরি করা নিবন্ধেও বিষয়গুলো একত্রিত করুন",
      },
      "অতিরিক্ত সংযোগ": {
        des: "নিবন্ধটি অনেক বেশি নিবন্ধে সংযুক্ত করা হয়ে থাকতে পারে, যা  সদৃশ এবং/অথবা অপ্রাসঙ্গিক।\n## '''উইকিপিডিয়ার গুণমানের মান পূরণের জন্য পরিষ্কার করার প্রয়োজন হতে পারে'''",
        soln: "উইকিপিডিয়া শৈলী নির্দেশিকা অনুযায়ী, সদৃশ সংযোগ, এবং যে কোন সংযোগ যা প্রসঙ্গের সাথে প্রাসঙ্গিক নয় তা সরান",
      },
      "অনির্ভরযোগ্য তথ্যসূত্র": {
        des: "নিবন্ধটির এক বা একাধিক তথ্যসূত্র [[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য]] নাও হতে পারে বলে মনে করা হয়েছে",
        soln: "আরও ভাল, আরও নির্ভরযোগ্য উৎস যোগ করুন। উইকিসংযোগ তথ্যসূত্র হিসাবে যোগ করবেন না",
      },
      অনুচ্ছেদসমূহ: {
        des: "প্রসঙ্গ অনুযায়ী আপনার তৈরিকৃত নিবন্ধটিকে '''আরও সহজগম্য করতে, বিষয় অনুসারে [[সাহায্য:অনুচ্ছেদ|অনুচ্ছেদে]] ভাগ করা উচিত'''",
        soln: "উইকিপিডিয়ার [[MOS:HEAD|রচনাশৈলী নির্দেশনা]] অনুযায়ী অধ্যায় শিরোনাম যোগ করুন",
      },
      "অনুলিপি প্রতিলেপন": {
        des: "নিবন্ধটি বা অনুচ্ছেদটি '''সম্ভবত কোন একটি উৎস থেকে হুবহু বা আংশিকভাবে [[উইকিপিডিয়া:অন্য উৎস থেকে লেখা অনুলিপি করা|নকল করে]] নিবন্ধে যুক্ত করা হয়েছে''', যা '''[[উইকিপিডিয়া:কপিরাইট|উইকিপিডিয়ার কপিরাইট নীতিমালা]] লঙ্ঘনের শামিল'''",
        soln: "সংশ্লিষ্ট অংশের ভাষা সম্পাদনা করে কিংবা কপিরাইটকৃত লেখা অপসারণ করে কিংবা একই বিষয়ের জন্য লভ্য কপিরাইটমুক্ত বিষয়বস্তু যোগ করুন। তা নাহলে নিবন্ধটি অপসারণ করা হতে পারে",
      },
      "অনুলিপি সম্পাদনা": {
        des: "উইকিপিডিয়ার মানদণ্ড উত্তীর্ণের জন্য অনুলিপি সম্পাদনা করা প্রয়োজন। কারণ '''ব্যাকরণ, রচনাশৈলী, বানান বা বর্ণনাভঙ্গিগত সমস্যা রয়েছে। তাই এটিতে [[উইকিপিডিয়া:রচনা সংশোধন|রচনা সংশোধনের]] প্রয়োজন রয়েছে বলে প্রতীয়মান হয়'''",
        soln: "ব্যাকরণ, রচনাশৈলী, বানান ও বর্ণনাভঙ্গিগত সমস্যা সমাধান করে নিবন্ধটি সংশোধন করুন",
      },
      অসংযুক্ত: {
        des: "নিবন্ধটি অন্য কোন নিবন্ধটির সাথে সংযুক্ত নেই। অর্থাৎ এটি একটি [[উইকিপিডিয়া:অনাথ নিবন্ধ|অনাথ নিবন্ধ]]",
        soln: "এই পাতাটি এর সম্পর্কিত নিবন্ধসমূহের সাথে সংযোগ করুন",
      },
      অসংলগ্ন: {
        des: "নিবন্ধ বা অনুচ্ছেদটি '''[[উইকিপিডিয়া:Guide to writing better articles#Stay_on_topic|একটি নির্দিষ্ট বিষয়কে]] উপস্থাপন করছে না'''",
        soln: "নিবন্ধটির অপ্রাসঙ্গিক তথ্য অপসারণ করে, বা [[উইকিপিডিয়া:বিভক্তিকরণ|এটিকে বিভক্ত করে]] বিষয় অনুসারে একাধিক নিবন্ধ তৈরি করুন। এ সম্পর্কে অন্য কোন মতামত থাকলে নিবন্ধটির আলাপ পাতায় লিখুন",
      },
      আত্মজীবনী: {
        des: "নিবন্ধটি '''একটি [[উইকিপিডিয়া:আত্মজীবনী|আত্মজীবনী]] অথবা এর বিষয় বা বিষয়ের সাথে সম্পর্কিত কারো দ্বারা ব্যাপকভাবে সম্পাদনা করা হয়েছে''' এবং সম্ভবত নিরপেক্ষভাবে লিখিত নয়",
        soln: "আপনি এটিকে [[উইকিপিডিয়া:আত্মজীবনী|আত্মজীবনী]] মনে না করলে বা অন্য কোনো মতামত থাকলে তা নিবন্ধটির আলাপ পাতায় ব্যক্ত করতে পারেন",
      },
      "আরও পাদটীকা": {
        des: "একটি [[উইকিপিডিয়া:উদ্ধৃত উৎস|তথ্যসূত্রের তালিকা]] রয়েছে, কিন্তু '''এতে পর্যাপ্ত [[উইকিপিডিয়া:উৎসনির্দেশ#সংগতিপূর্ণ উদ্ধৃতি|সংগতিপূর্ণ উদ্ধৃতির]]''' অভাব রয়েছে",
        soln: "আরও [[উইকিপিডিয়া:কখন উদ্ধৃতি দেবেন|পাদটীকা]] যুক্ত করে এই নিবন্ধটির [[উইকিপিডিয়া:উইকিপ্রকল্প নির্ভরযোগ্যতা|মানোন্নয়ন]] করুন।\n## জানুন কখন ও কিভাবে [[সাহায্য:পাদটীকা|পাদটীকা]] যোগ করবেন",
      },
      "উদ্ধৃতিদান শৈলী": {
        des: "নিবন্ধটির '''তথ্যসূত্র উদ্ধৃতিদানশৈলী ঠিক নেই'''",
        soln: "অন্যান্য প্রতিষ্ঠিত নিয়মকানুন অবলম্বন করে [[উইকিপিডিয়া:উৎসনির্দেশ|উৎসনির্দেশ]], [[সাহায্য:পাদটীকা|পাদটীকা]], অথবা [[উইকিপিডিয়া:বহিঃসংযোগ|বহিঃসংযোগ]] প্রদানের মাধ্যমে তথ্যসূত্রগুলো আরও পরিষ্কার করে উপস্থাপন করুন",
      },
      উল্লেখযোগ্যতা: {
        des: "'''নিবন্ধটির বিষয়বস্তু [[উইকিপিডিয়া:উল্লেখযোগ্যতা|উল্লেখযোগ্যতার সাধারণ নির্দেশাবলী]] অনুসরণ করেনি'''",
        soln: "নিবন্ধটির উল্লেখযোগ্যতা প্রতিষ্ঠার জন্য বিষয়বস্তু প্রসারিত করুন, [[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|বিশ্বস্ত সূত্র]] থেকে [[উইকিপিডিয়া:উৎসনির্দেশ|সত্যতা]] প্রমাণ করুন। যদি উল্লেখযোগ্যতা প্রমাণ না হয়, তাহলে এ নিবন্ধটি [[উইকিপিডিয়া:অপসারণ নীতি|অপসারণ নীতি]] অনুযায়ী মুছে ফেলার যোগ্য বলে বিবেচিত হবে অথবা এ সম্পর্কিত অন্য নিবন্ধে এটিকে [[উইকিপিডিয়া:একীকরণ|একীকরণ]] করা হবে",
      },
      উৎসহীন: {
        des: "নিবন্ধটিতে কোন [[উইকিপিডিয়া:যাচাইযোগ্যতা|উৎস বা তথ্যসূত্র]] [[উইকিপিডিয়া:উৎসনির্দেশ|উদ্ধৃত]] নেই",
        soln: "[[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য উৎস]] থেকে [[উইকিপিডিয়া:যাচাইযোগ্যতা|তথ্যসূত্র প্রদান করে]] এই নিবন্ধটির মানোন্নয়ন করুন। তা নাহলে নিবন্ধটি অপসারণ করা হতে পারে",
      },
      "একটি উৎস": {
        des: "নিবন্ধটির একটা বড়সড় অংশ কিংবা সম্পূর্ণ অংশই একটিমাত্র সূত্রের উপর নির্ভরশীল",
        soln: "[[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য উৎস]] থেকে আরো বেশি [[উইকিপিডিয়া:যাচাইযোগ্যতা|তথ্যসূত্র প্রদান করে]] এই নিবন্ধটির মানোন্নয়ন করুন। তা নাহলে নিবন্ধটি অপসারণ করা হতে পারে",
      },
      একীকরণ: {
        des: "নিবন্ধটি অন্য একটি নিবন্ধটির সাথে একত্রীকরণ করার প্রস্তাব করা হয়েছে",
        soln: "আপনার যদি একীকরণে আপত্তি থাকে, তবে নিবন্ধটির আলাপ পাতায় এ সম্পর্কে আলোচনা করতে পারেন",
      },
      কমসংযুক্ত: {
        des: "বিশ্বকোষীয় পর্যায়ে যেতে এই নিবন্ধে আরো বেশি অন্য নিবন্ধের সাথে সংযোগ করা প্রয়োজন",
        soln: "নিবন্ধের মাঝে প্রাসঙ্গিক সংযোগ যুক্ত করার মাধ্যমে এই নিবন্ধের উন্নয়নে সহায়তা করুন। অর্থাৎ, নিবন্ধের মাঝে ব্যবহৃত বিভিন্ন শব্দের সাথে উইকিসংযোগ প্রদান করুন",
      },
      "কম সংযুক্ত": {
        des: "বিশ্বকোষীয় পর্যায়ে যেতে এই নিবন্ধে আরো বেশি অন্য নিবন্ধের সাথে সংযোগ করা প্রয়োজন",
        soln: "নিবন্ধের মাঝে প্রাসঙ্গিক সংযোগ যুক্ত করার মাধ্যমে এই নিবন্ধের উন্নয়নে সহায়তা করুন। অর্থাৎ, নিবন্ধের মাঝে ব্যবহৃত বিভিন্ন শব্দের সাথে উইকিসংযোগ প্রদান করুন",
      },
      "কারিগরি পরিভাষার আধিক্য": {
        des: "নিবন্ধটিতে '''এত বেশী কারিগরি পরিভাষা ব্যবহার করা হয়েছে যে হয়ত অধিকাংশ পাঠকের জন্য বিশেষ করে অদীক্ষিত পাঠকের জন্য এটি বোঝা দুরূহ হতে পারে'''",
        soln: "কারিগরি তথ্য অপসারণ না করে [[উইকিপিডিয়া:কারিগরি নিবন্ধগুলি বোধগম্য করুন|অনভিজ্ঞ সাধারণ পাঠকের নিকট আরও বেশি বোধগম্য]] করুন। আলাপ পাতায় এ বিষয়ে আরও বিস্তারিত থাকতে পারে",
      },
      কাল্পনিক: {
        des: "নিবন্ধ অথবা অনুচ্ছেদটি '''বাস্তবতা এবং কাল্পনিকের মধ্যে একটি সুস্পষ্ট পার্থক্য করতে ব্যর্থ হতে পারে'''। নিবন্ধটি তথ্যপূর্ণ না হয়ে একটি উপন্যাসের মত লেখা হয়েছে",
        soln: "কাল্পনিক গল্পের নির্দেশিকা অনুযায়ী এটি পুনরায় লিখুন",
      },
      "খালি ইউআরএল পরিষ্কারকরণ": {
        des: "নিবন্ধটিতে তথ্যসূত্রের জন্য খালি ইউআরএল ব্যবহার করা হয়েছে, যা মূল লিংকের সাথে সঙ্গতিপূর্ণ নয়",
        soln: "নিবন্ধটির [[উইকিপিডিয়া:যাচাইযোগ্যতা|যাচাইযোগ্যতার]] জন্য [[উইকিপিডিয়া:উৎসনির্দেশ#Citation%20styles|সম্পূর্ণ উদ্ধৃতি]] যোগ করুন",
      },
      "খুব দীর্ঘ": {
        des: "নিবন্ধটি '''সচ্ছন্দে পড়া এবং ব্যবহার করার ক্ষেত্রে সম্ভবত [[উইকিপিডিয়া:Article size|খুব দীর্ঘ]]'''",
        soln: "বিষয়বস্তুর মূল্য তথ্যটির [[উইকিপিডিয়া:Summary style|সারমর্ম]] লেখার স্বার্থে এর তথ্যগুলোকে ভাগ করে বিভিন্ন উপ-নিবন্ধে লেখার চিন্তা করুন",
      },
      গদ্য: {
        des: "নিবন্ধটি একটি '''তালিকা আকারে আছে যা [[উইকিপিডিয়া:রচনাশৈলী নির্দেশনা/অন্তর্নিবন্ধ তালিকা#গদ্য_বনাম_তালিকা|গদ্য]] লেখায় আরো ভালোভাবে উপস্থাপন করা যেত'''",
        soln: "[[উইকিপিডিয়া:রচনাশৈলী নির্দেশনা/অন্তর্নিবন্ধ তালিকা#তালিকার_উপযুক্ত_ব্যবহার|উপযুক্ত যায়গায়]] আপনি এ নিবন্ধটি গদ্যে লিখে সাহায্য করতে পারেন। প্রয়োজনে [[সাহায্য:সূচী|সম্পাদনা সহায়িকা]] দেখুন",
      },
      "ছোট নিবন্ধ": {
        des: "'''নিবন্ধটি আকারে অনেক ছোট'''",
        soln: "নিবন্ধটি সম্প্রসারণ করে উইকিপিডিয়াকে সাহায্য করুন। অন্যথায়, এটি [[উইকিপিডিয়া:অপসারণ নীতি|অপসারণের]] জন্য বিবেচিত হতে পারে",
      },
      "জী-ব্য-জী উৎসহীন": {
        des: "নিবন্ধটি [[উইকিপিডিয়া:জীবিত ব্যক্তির জীবনী|জীবিত ব্যক্তির জীবনীমূলক]] নিবন্ধে তথ্য যাচাইয়ের জন্য কোনো [[উইকিপিডিয়া:যাচাইযোগ্যতা|নির্ভরযোগ্য তথ্যসূত্র]] থেকে [[উইকিপিডিয়া:উৎসনির্দেশ|উদ্ধৃতি প্রদান]] করা হয়নি",
        soln: "[[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য উৎস]] থেকে তথ্যসূত্র সংযুক্ত করুন। জীবিত ব্যক্তির ক্ষেত্রে বিতর্কিত হতে পারে এমন উৎসবিহীন অথবা অপর্যাপ্তভাবে উৎসবিহীন উপাদান, বিশেষত যদি সম্ভাব্য কুৎসাপূর্ণ বা ক্ষতিকর হিসেবে গণ্য হয় তবে তা অচিরেই অপসারণ করা হবে",
      },
      "জী-ব্য-জী তথ্যসূত্র": {
        des: "নিবন্ধটি [[উইকিপিডিয়া:জীবিত ব্যক্তির জীবনী|জীবিত ব্যক্তির জীবনীমূলক]] নিবন্ধটির '''[[উইকিপিডিয়া:যাচাইযোগ্যতা|তথ্য যাচাইয়ের]] জন্য অতিরিক্ত সূত্র থেকে [[উইকিপিডিয়া:উৎসনির্দেশ|উদ্ধৃতিদান]] করা প্রয়োজন",
        soln: "'''[[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য উৎস সংযুক্ত]] করুন। জীবিত ব্যক্তির ক্ষেত্রে বিতর্কিত হতে পারে এমন উৎসবিহীন অথবা অপার্যপ্তভাবে উৎসবিহীন উপাদান, বিশেষভাবে যদি সম্ভাব্য '''কুৎসাপূর্ণ বা ক্ষতিকর হিসেবে গণ্য হয় তবে তা অচিরেই অপসারণ করা হবে'''",
      },
      নিরপেক্ষতা: {
        des: "নিবন্ধটির '''[[উইকিপিডিয়া:নিরপেক্ষ দৃষ্টিভঙ্গি|নিরপেক্ষতা]] নিয়ে [[উইকিপিডিয়া:সংঘাত নিরসন|বিতর্ক]]''' রয়েছে",
        soln: "প্রাসঙ্গিক আলোচনা নিবন্ধটির আলাপ পাতায় পাওয়া যেতে পারে। [[উইকিপিডিয়া:সংঘাত নিরসন#সংঘাত নিরসন|বিতর্ক নিরসন]] হওয়ার আগ পর্যন্ত {{tl|নিরপেক্ষতা টেমপ্লেটটি}} সরিয়ে ফেলবেন না",
      },
      পরিষ্করণ: {
        des: "নিবন্ধটি '''উইকিপিডিয়ার জন্য [[উইকিপিডিয়া:রচনাশৈলী নির্দেশনা|মানসম্পন্ন অবস্থায়]] আনতে [[উইকিপিডিয়া:নিবন্ধ ত্রুটি দূরীকরণ|পরিচ্ছন্ন]] করা প্রয়োজন'''। ",
        soln: "নিবন্ধটিতে [[উইকিপিডিয়া:নিবন্ধ ত্রুটি দূরীকরণ|পরিচ্ছন্ন]] সমস্যা সম্পর্কে আরো বিস্তারিত থাকতে পারে। এর আলাপ পাতায় প্রাসঙ্গিক আলোচনা পাওয়া যেতে পারে। নিবন্ধটি পরিষ্কার করার আগ পর্যন্ত {{tl|পরিষ্করণ}} টেমপ্লেটটি সরিয়ে ফেলবেন না",
      },
      "পরিষ্করণ-পুনঃসংগঠন": {
        des: "নিবন্ধটি '''[[উইকিপিডিয়া:রচনাশৈলী নির্দেশনা|উইকিপিডিয়ার জন্য মানসম্পন্ন অবস্থায়]] আনতে পুনঃসংগঠন করা প্রয়োজন'''",
        soln: "এই নিবন্ধের মানোন্নয়নে এবং এর সার্বিক গঠন পরিবর্তনে [[উইকিপিডিয়া:সাহসী হোন|সাহসী হোন]]। নিবন্ধটি পরিষ্কার করার আগ পর্যন্ত {{tl|পরিষ্করণ-পুনঃসংগঠন}} টেমপ্লেটটি সরিয়ে ফেলবেন না",
      },
      "পাদটীকা নেই": {
        des: "নিবন্ধটিতে [[উইকিপিডিয়া:উৎসনির্দেশ|তথ্যসূত্রের একটি তালিকা]], সম্পর্কিত পাঠ বা [[উইকিপিডিয়া:বহিঃসংযোগ|বহিঃসংযোগ]] রয়েছে, কিন্তু '''এটির তথ্যসূত্রসমূহ অস্পষ্ট কারণ এখানে [[উইকিপিডিয়া:উৎসনির্দেশ#Inline%20citations|বাক্য সংশ্লিষ্ট সূত্র বা টীকা]] নেই'''",
        soln: "বিষয়বস্তুকে স্পষ্ট করতে প্রয়োজনমতো টীকা যোগ করুন",
      },
      "পুরোটাই দৃশ্যপট": {
        des: "নিবন্ধটি '''প্রায় পুরোটাই একটি [[উইকিপিডিয়া:What Wikipedia is not#PLOT|দৃশ্যপট]]'''",
        soln: "বিশ্বকোষীয় নিবন্ধের নীতিমালা মেনে এর পরিবর্ধন করা দরকার। বিষয়বস্তুর উপর ভিত্তি করে নিবন্ধটি সম্পাদনা করুন",
      },
      "প্রাথমিক উৎস": {
        des: "নিবন্ধটি '''[[উইকিপিডিয়া:Verifiability|যাচাইযোগ্যতার]] জন্য [[উইকিপিডিয়া:কোনো মৌলিক গবেষণা নয়#প্রাথমিক, দ্বিতীয় এবং তৃতীয় উৎস|প্রাথমিক উৎসের]] উপর প্রবলভাবে নির্ভর করে",
        soln: "[[উইকিপিডিয়া:Independent sources|স্বাধীন]] দ্বিতীয় বা তৃতীয় কোন উৎস থেকে উদ্ধৃতি দিয়ে এই নিবন্ধটি উন্নয়ন করুন",
      },
      "বর্ণনা ভঙ্গি": {
        des: "নিবন্ধটির '''[[উইকিপিডিয়া:TONE|বর্ণনা ভঙ্গি]] উইকিপিডিয়ার বিশ্বকোষীয় বর্ণনা ভঙ্গি প্রতিফলিত করেনি'''",
        soln: "অনুলিপি সম্পাদনা করে বর্ণনা ভঙ্গি ঠিক করুন। নির্দেশনা পেতে [[উইকিপিডিয়া:Guide to writing better articles|সঠিক নিবন্ধ লেখার নির্দেশনা]] দেখুন। এই ব্যাপারে নির্দিষ্ট আলোচনা নিবন্ধটির আলাপ পাতায় পাওয়া যেতে পারে",
      },
      বহিঃসংযোগসমূহ: {
        des: "নিবন্ধটিতে '''[[উইকিপিডিয়া:External links|বহিঃসংযোগের]] ব্যবহার সম্ভবত উইকিপিডিয়ার রচনাশৈলী অনুযায়ী নয়'''",
        soln: "[[উইকিপিডিয়া:উইকিপিডিয়া_কী_নয়#উইকিপিডিয়া_কোনো_লিংক,_ছবি,_বা_অন্যান্য_মিডিয়া_ফাইল_রাখার_ভান্ডার_নয়|মাত্রাতিরিক্ত]] বা [[উইকিপিডিয়া:External links|অনুপযুক্ত]] বহিঃসংযোগগুলি অপসারণ করে এবং উপযুক্ত ক্ষেত্রে উপকারী বহিঃসংযোগগুলিকে [[উইকিপিডিয়া:Citing sources|তথ্যসূত্র ও পাদটীকাতে]] রূপান্তরিত করে নিবন্ধটির উন্নয়ন করুন",
      },
      "বাংলা নয়": {
        des: "'''নিবন্ধটি বাংলায় [[উইকিপিডিয়া:অনুবাদ|অনুবাদ]] করা প্রয়োজন।''' এ ধরনের স্বয়ংক্রিয় সরঞ্জাম দ্বারা অনুবাদকৃত লেখা উইকিপিডিয়াতে সংযোজন করবেন না, কারণ সাধারণত এই সরঞ্জামগুলোর অনুবাদ মানসম্পন্ন হয় না",
        soln: "দয়া করে এ ধরনের লেখাগুলো প্রথমে হাতে করে অনুবাদ করুন। এরপর অনুবাদকৃত লেখাগুলো সম্পাদনা করে নিবন্ধটিকে বাংলায় লিখুন",
      },
      বিজ্ঞাপন: {
        des: "নিবন্ধটি বিজ্ঞাপনের মতো করে লেখা হয়েছে যা উইকিপিডিয়ার রচনাশৈলী অনুযায়ী ঠিক নয়",
        soln: "[[উইকিপিডিয়া:নিরপেক্ষ দৃষ্টিভঙ্গি|নিরপেক্ষ দৃষ্টিভঙ্গি]] থেকে সম্পাদনা করে নিবন্ধটির মান উন্নয়ন করুন এবং অপ্রাসঙ্গিক [[উইকিপিডিয়া:EL|বহিঃসংযোগগুলো]] অপসারণ করুন",
      },
      বিতর্কিত: {
        des: "নিবন্ধটির তথ্যসমূহের '''যথার্থতা সম্পর্কে [[উইকিপিডিয়া:Accuracy dispute|বিতর্ক]] রয়েছে'''বলে প্রতীয়মান হয়",
        soln: " বিতর্কিত উক্তি বা তথ্যসমূহের জন্য অবশ্যই [[উইকিপিডিয়া:RS|নির্ভরযোগ্য তথ্যসূত্র]] প্রদান করুন",
      },
      বিভ্রান্তিকর: {
        des: "নিবন্ধটি '''[[উইকিপিডিয়া:দুর্বোধ্য|বিভ্রান্তিকর বা অবোধ্য]] বলে মনে হচ্ছে'''",
        soln: "[[উইকিপিডিয়া:Please clarify|বিভ্রান্তি]] নিরসন করুন। অবোধ্য ভাষা ও শব্দ পরিহার করে নিবন্ধটির মানোন্নয়ন করুন ।নিবন্ধের আলাপ পাতায় এ বিষয়ে প্রয়োজনীয় দিকনির্দেশনা থাকতে পারে",
      },
      "বিষয়শ্রেণী উন্নয়ন": {
        des: "নিবন্ধটিতে '''অতিরিক্ত অথবা আরো বৈশিষ্ট্যসূচক [[উইকিপিডিয়া:Categorization|বিষয়শ্রেণী]]''' প্রয়োজন",
        soln: "এটিতে আরো [[উইকিপিডিয়া:বিষয়শ্রেণীকরণ#Categorizing_pages|বিষয়শ্রেণী যোগ করুন]], যেন এটি এই বিষয়ের অন্যান্য নিবন্ধের সাথে আপনার নিবন্ধটি তালিকাভুক্ত করা যায়। সহজে কোনো পাতায় একই সাথে এক বা একাধিক বিষয়শ্রেণী সংযোজন, বিয়োজন, বা পরিবর্তনের জন্য [[c:Help:Gadget-HotCat|হটক্যাট]] ব্যবহার করতে পারেন। এটি আপনার [[বিশেষ:পছন্দসমূহ#mw-prefsection-gadgets|গ্যাজেট]] অংশ থেকে চালু করতে পারেন।",
      },
      বিষয়শ্রেণীহীন: {
        des: "নিবন্ধটিতে কোনও '''[[উইকিপিডিয়া:বিষয়শ্রেণীকরণ|বিষয়শ্রেণী]] যোগ করা হয়নি'''",
        soln: "একটি [[উইকিপিডিয়া:বিষয়শ্রেণীকরণ#Categorizing_pages|বিষয়শ্রেণী যোগ করুন]], যেন এটি এই বিষয়ের অন্যান্য নিবন্ধের সাথে আপনার নিবন্ধটি তালিকাভুক্ত করা যায়। সহজে কোনো পাতায় একই সাথে এক বা একাধিক বিষয়শ্রেণী সংযোজন, বিয়োজন, বা পরিবর্তনের জন্য [[c:Help:Gadget-HotCat|হটক্যাট]] ব্যবহার করতে পারেন। এটি আপনার [[বিশেষ:পছন্দসমূহ#mw-prefsection-gadgets|গ্যাজেট]] অংশ থেকে চালু করতে পারেন।",
      },
      "বৈশ্বিক দৃষ্টিভঙ্গি": {
        des: "নিবন্ধটির বিষয়বস্তু ও উদাহরণ বিশ্বব্যাপী ধারণকে উপস্থাপিত করেনি",
        soln: "নিবন্ধটির মানোন্নয়ন করুন এবং এ বিষয়ে নিবন্ধের আলাপ পাতায় আলোচনা থাকতে পারে। না থাকলে একটি আলোচনা শুরু করুন",
      },
      "ভাষা সম্প্রসারণ": {
        des: "নিবন্ধটি একটি বিদেশী ভাষার উইকিপিডিয়া থেকে উপাদান দিয়ে প্রসারিত করা প্রয়োজন",
        soln: "অনির্ভরযোগ্য বা নিম্ন মানের পাঠ্যগুলো অনুবাদ করবেন না। যদি সম্ভব হয়, বিদেশী ভাষার নিবন্ধে প্রদত্ত তথ্যসূত্রসহ পাঠ্য যাচাই করুন।\n## অনুবাদ করার পরে, নিবন্ধের আলাপ পাতায় অবশ্যই {{tl|অনূদিত পাতা}} যোগ করুন।\n## নির্দেশিকার জন্য [[উইকিপিডিয়া:অনুবাদ]] দেখুন",
      },
      "ভূমিকাংশ অতি দীর্ঘ": {
        des: "নিবন্ধটিতে '''[[উইকিপিডিয়া:Lead section guidelines|ভূমিকাংশটি]] তার সামগ্রিক দৈর্ঘের তুলনায় অনেক বড়''', যা সংক্ষিপ্ত করা প্রয়োজন",
        soln: "নিবন্ধের ভূমিকাংশ থেকে কিছু বিষয়বস্তু অপসারণ করুন।\n## আরও তথ্যের জন্য [[উইকিপিডিয়া:Layout guide|লেআউট গাইড]] এবং উইকিপিডিয়ার [[উইকিপিডিয়া:Lead section guidelines|ভূমিকাংশ নির্দেশিকা]] পড়ুন",
      },
      "ভূমিকাংশ অনুপস্থিত": {
        des: "নিবন্ধটিতে [[উইকিপিডিয়া:Lead section guidelines|ভূমিকাংশ]] অনুপস্থিত",
        soln: "এতে একটি ভূমিকাংশ যুক্ত করুন। আরও তথ্যের জন্য, দেখুন: [[উইকিপিডিয়া:ভূমিকাংশ নীতিমালা|ভূমিকাংশ নীতিমালা]]",
      },
      "ভূমিকাংশ খুবই সংক্ষিপ্ত": {
        des: "নিবন্ধের [[উইকিপিডিয়া:ভূমিকাংশ|ভূমিকাংশ]] খুবই সংক্ষিপ্ত, যা নিবন্ধটি সম্পর্কে সংক্ষিপ্ত বিবরণ দেওয়ার জন্য যথেষ্ট নয়",
        soln: "এর ভূমিকাংশ বর্ধনে নিবন্ধের মূল বিষয়গুলোর [[উইকিপিডিয়া:রচনাশৈলী_নির্দেশনা/ভূমিকাংশ#একটি_সহজবোধ্য_ওভারভিউ_দেয়া|প্রতি গ্রহণযোগ্য দৃষ্টি]] দিন",
      },
      "ভূমিকাংশ পুনর্লিখন": {
        des: "উইকিপিডিয়ার [[উইকিপিডিয়া:Lead section guidelines|ভূমিকাংশ নীতিমালা]] অনুসারে, এই '''নিবন্ধের ভূমিকাংশটি পুনরায় পরিষ্কার করে লেখা প্রয়োজন'''",
        soln: "'''বিষয়টি নিয়ে নিবন্ধের আলাপ পাতায় আলোচনা করুন এবং উইকিপিডিয়ার [[উইকিপিডিয়া:Layout guide|লেআউট গাইড]] দেখুন যাতে নিবন্ধের ভূমিকাংশে সব গুরুত্বপূর্ণ বিবরণ রাখা আপনার পক্ষে সহজ হয়",
      },
      মেয়াদউত্তীর্ণ: {
        des: "নিবন্ধটির অপ্রচলিত তথ্য সরানো অথবা হালনাগাদ করা প্রয়োজন অর্থাৎ নিবন্ধটি '''মেয়াদোত্তীর্ণ'''",
        soln: "সাম্প্রতিক ঘটনা বা সদ্যলভ্য তথ্য প্রতিফলিত করার জন্য নিবন্ধটি হালনাগাদ করুন এবং এর উপর সম্ভাব্য আলোচনার জন্য নিবন্ধটির আলাপ পাতায় দেখুন বা আলোচনা শুরু করুন",
      },
      "মৌলিক গবেষণা": {
        des: "নিবন্ধ বা অনুচ্ছেদটিতে '''[[উইকিপিডিয়া:No original research|মৌলিক গবেষণাযুক্ত]] উপাদান রয়েছে অথবা [[উইকিপিডিয়া:Verifiability|যাচাইবিহীনভাবে দাবি করা হয়েছে]]'''",
        soln: "উপযুক্ত [[উইকিপিডিয়া:উৎসনির্দেশ|তথ্যসূত্র]] এবং [[উইকিপিডিয়া:যাচাইযোগ্যতা|উৎস প্রদান করে]] নিবন্ধটির মানোন্নয়ন করুন। আরও বিস্তারিত জানতে নিবন্ধের আলাপ পাতায় দেখুন বা আলোচনা শুরু করুন",
      },
      "যান্ত্রিক অনুবাদ": {
        des: "'''নিবন্ধটি অন্য একটি ভাষা থেকে আনাড়িভাবে [[উইকিপিডিয়া:অনুবাদ|অনুবাদ]] করা হয়েছে'''",
        soln: "অনুবাদটি সংশোধন করুন।\n## সরাসরি যান্ত্রিক অনুবাদ নিবন্ধে যোগ করবে না।\n## যান্ত্রিক ভাবে অনুবাদ করলেও অনুবাদটি সংশোধন করুন।\n## যান্ত্রিক অনুবাদ করার জন্য [[বিশেষ:বিষয়বস্তু অনুবাদ|উইকিপিডিয়ার অনুবাদক পাতা]] ব্যবহার করতে পারেন। এতে অনুবাদের মান কিছুটা ভালো হয়।\n## যান্ত্রিক অনুবাদ করার জন্য অনুবাদক পাতা ব্যবহার করলেও অনুবাদটি সংশোধন করে বোধগম্য করুন।\n## অনুবাদে যান্ত্রিকতার অস্বাভাবিক ব্যবহার থাকলে নিবন্ধটি '''অপসারণ''' করা হতে পারে",
      },
      "রচনা সংশোধন": {
        des: "নিবন্ধটির [[উইকিপিডিয়া:রচনা সংশোধন|ব্যাকরণ, রচনাশৈলী, বানান বা বর্ণনাভঙ্গিগতর]] জন্য রচনা সংশোধনের প্রয়োজন",
        soln: "অনুলিপি সম্পাদনার মাধ্যমে সংশোধন করুন।\n##[[সাহায্য:রক্ষণাবেক্ষণ টেমপ্লেট সরানো|জানুন কীভাবে ও কখন নিবন্ধ থেকে টেমপ্লেট বার্তাটি সরাবেন]]''",
      },
      রচনানুগ: {
        des: "নিবন্ধটি '''এমনভাবে লেখা হয়েছে যে মনে হচ্ছে এটি [[উইকিপিডিয়া:উইকিপিডিয়া_কী_নয়#উইকিপিডিয়া_মৌলিক_চিন্তার_প্রকাশস্থল_নয়|একটি ব্যক্তিগত ভাবনা বা মতামত সম্বলিত রচনা]] এবং হয়তো নিবন্ধটির [[উইকিপিডিয়া:Cleanup|পরিচ্ছন্নকরণ]] প্রয়োজন",
        soln: "নিবন্ধটিকে [[উইকিপিডিয়া:রচনাশৈলী নির্দেশনা|বিশ্বকোষীয় শৈলীতে]] পুনরায় লিখে এর মানোন্নয়ন করুন",
      },
      সংযোগহীন: {
        des: "নিবন্ধটির সাথে '''[[উইকিপিডিয়া:Manual of Style/Linking|অন্য কোন উইকিপিডিয়া নিবন্ধের সংযোগ নেই]]'''",
        soln: "নিবন্ধের বাক্যের তথ্যসমূহের সাথে ও [[উইকিপিডিয়া:Only make links that are relevant to the context|বিষবস্তুর সাথে সামঞ্জস্য রয়েছে এমন নিবন্ধসমূহের সাথে]] উইকিসংযোগ প্রদানের মাধ্যমে নিবন্ধটির উন্নয়ন করুন",
      },
      "সূত্র উন্নতি": {
        des: "নিবন্ধের '''[[উইকিপিডিয়া:যাচাইযোগ্যতা|যাচাইযোগ্যতার]] জন্য অতিরিক্ত [[উইকিপিডিয়া:উৎসনির্দেশ|তথ্যসূত্র]] প্রয়োজন'''",
        soln: "[[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|নির্ভরযোগ্য উৎস]] থেকে  [[উইকিপিডিয়া:যাচাইযোগ্যতা|তথ্যসূত্র প্রদান করে]] এই নিবন্ধটির মানোন্নয়ন করুন। তা নাহলে নিবন্ধটি অপসারণ করা হতে পারে।\n## উৎস সংগ্রহ করতে গুগোলে সার্চ করে [[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|বিশ্বাসযোগ্য উৎস]] থেকে প্রাপ্ত তথ্যসূত্র যোগ করুন",
      },
      স্বপ্রকাশিত: {
        des: "নিবন্ধটিতে '''[[উইকিপিডিয়া:যাচাইযোগ্যতা#স্বপ্রকাশিত উৎস|স্বপ্রকাশিত উৎসের]] অনুপযুক্ত ব্যবহার থাকতে পারে''' বলে ধারণা করা হচ্ছে",
        soln: "যেখানে তথ্যসূত্রসমূহ অনুপযুক্তভাবে ব্যবহৃত হয়েছে সেখানের অনির্ভরযোগ্য [[উইকিপিডিয়া:নির্ভরযোগ্য উৎস|উৎসের]] তথ্যসূত্রসমূহ অপসারণ করুন। তা নাহলে নিবন্ধটি অপসারণ করা হতে পারে।\n## অথবা নিবন্ধটির আলাপ পাতায় আপনার পক্ষে যুক্তি দিন",
      },
      হালনাগাদ: {
        des: "নিবন্ধটিতে হালনাগাদকৃত অতিরিক্ত তথ্য যোগ করা প্রয়োজন, কারণ নিবন্ধটি '''মেয়াদোত্তীর্ণ'''",
        soln: "সাম্প্রতিক ঘটনা বা সদ্যলভ্য তথ্য প্রতিফলিত করার জন্য নিবন্ধটি হালনাগাদ করুন এবং এর উপর সম্ভাব্য আলোচনার জন্য নিবন্ধটির আলাপ পাতা দেখুন",
      },
      অসম্পূর্ণ: {
        des: "নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "জীববিজ্ঞান-অসম্পূর্ণ": {
        des: "[[জীববিজ্ঞান]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "রসায়ন-অসম্পূর্ণ": {
        des: "[[রসায়ন]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "রসায়ন সম্পর্কিত নিবন্ধসমূহ, বিশেষ করে রাসায়নিক যৌগ সম্পর্কিত নিবন্ধগুলো স্বভাবতই বড় হয় না! তাই এসকল নিবন্ধের অনুবাদ অসম্পূর্ণ রাখবেন না",
      },
      "বিজ্ঞান-অসম্পূর্ণ": {
        des: "[[বিজ্ঞান]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "বিষমচাক্রিক-অসম্পূর্ণ": {
        des: "[[বিষমচাক্রিক]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "রসায়ন সম্পর্কিত নিবন্ধসমূহ, বিশেষ করে রাসায়নিক যৌগ সম্পর্কিত নিবন্ধগুলো স্বভাবতই বড় হয় না! তারপর এটি একটি জৈব যৌগ হওয়ায় নিবন্ধটি আরও সংক্ষিপ্ত তাই এসকল নিবন্ধের অনুবাদ অসম্পূর্ণ রাখবেন না",
      },
      "কম্পিউটার বিজ্ঞান-অসম্পূর্ণ": {
        des: "[[কম্পিউটার]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "গণিত-অসম্পূর্ণ": {
        des: "[[গণিত]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "অসম্পূর্ণ-জীবনী": {
        des: "[[জীবনী]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "ভৌগোলিক অবস্থান-অসম্পূর্ণ": {
        des: "[[ভৌগোলিক অবস্থান]]এর সাথে সম্পর্কিত নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "প্রাণী অসম্পূর্ণ": {
        des: "[[প্রাণী]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "চিকিৎসা বিজ্ঞান-অসম্পূর্ণ": {
        des: "[[চিকিৎসা বিজ্ঞান]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "টেলিভিশন ধারাবাহিক অসম্পূর্ণ": {
        des: "[[টেলিভিশন ধারাবাহিক]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "চলচ্চিত্র-অসম্পূর্ণ": {
        des: "[[চলচ্চিত্র]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "চলচ্চিত্র বিষয়ক নিবন্ধসমূহে সাধারণত বেশি তথ্য থাকে না। তাই এই ধরনের নিবন্ধগুলো অসম্পূর্ণ রাখবেন না।\n## অন্তত পক্ষে শ্রেষ্ঠাংশ এবং কাহিনী অংশটি অসম্পূর্ণ রাখবেন না",
      },
      "ধর্ম-অসম্পূর্ণ": {
        des: "[[ধর্ম]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "এভিয়েশন-অসম্পূর্ণ": {
        des: "[[এভিয়েশন]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "ওয়েবসাইট অসম্পূর্ণ": {
        des: "[[ওয়েবসাইট]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "খাদ্য অসম্পূর্ণ": {
        des: "[[খাদ্য]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
      "অ্যানিমে-অসম্পূর্ণ": {
        des: "[[অ্যানিমে]] বিষয়ক নিবন্ধটি একটি অসম্পূর্ণ নিবন্ধ",
        soln: "",
      },
    };
    if (
      mw.config.get("wgNamespaceNumber") === 0 &&
      mw.config.get("wgArticleId") &&
      !mw.config.get("wgIsMainPage")
    ) {
      // added button to the page
      var button = $(
        mw.util.addPortletLink(area, "#", "বার্তা দিন", "msg-send-tool")
      );
      // find the creator of the page
      creatorLookOut(pagename, function (params) {
        var creator = params.creator;
        var creation = params.creation;
        var sender = mw.config.get("wgUserName");
        button.click(function () {
          // users last contribution
          usrLstContribution(creator, function (usrdata) {
            var lastCdate = usrdata.date;
            var lastCdays = usrdata.days;
            var diff = today - new Date(creation);
            var longLongAgo = Math.floor(diff / (1000 * 60 * 60 * 24));
            var msg = "আপনি কি " + creator + "-কে বার্তা দিতে চান?";
            if (lastCdays > 30) {
              msg =
                "ব্যবহারকারী:" +
                creator +
                " সর্বশেষ সম্পাদনা করেছেন " +
                lastCdate +
                " তারিখে অর্থাৎ " +
                lastCdays +
                " দিন আগে। আপনি কি তাঁকে বার্তা দিতে চান?";
              if (longLongAgo > 365) {
                msg =
                  "ব্যবহারকারী:" +
                  creator +
                  " সর্বশেষ সম্পাদনা করেছেন " +
                  lastCdate +
                  " তারিখে অর্থাৎ " +
                  lastCdays +
                  " দিন আগে এবং তিনি এই পাতাটি " +
                  longLongAgo +
                  " দিন আগে তৈরি করেছেন, হয়তো প্রণেতা সর্বশেষ পরিবর্তনগুলোও করেননি। বার্তা দেওয়ার পূর্বে পাতার ইতিহাস যাচাই করে নিন। আপনি কি তাঁকে বার্তা দিতে চান?";
              }
            } else {
              if (longLongAgo > 365) {
                msg =
                  "ব্যবহারকারী:" +
                  creator +
                  " সর্বশেষ সম্পাদনা করেছেন " +
                  lastCdate +
                  " তারিখে অর্থাৎ " +
                  lastCdays +
                  " দিন আগে এবং তিনি এই পাতাটি " +
                  longLongAgo +
                  " দিন আগে তৈরি করেছেন, হয়তো প্রণেতা সর্বশেষ পরিবর্তনগুলোও করেননি। বার্তা দেওয়ার পূর্বে পাতার ইতিহাস যাচাই করে নিন। আপনি কি তাঁকে বার্তা দিতে চান?";
              }
            }
            fillterTags(pagename, function (tags) {
              if (tags.length > 0) {
                var multiple = tags.length > 1 ? true : false;
                // check if the creator is the sender
                if (creator === sender) {
                  msg = "আপনি কি নিজেকে বার্তা দিতে চান?";
                  if (confirm(msg)) {
                    main(creator, creation, sender, tags, pagename, multiple);
                  } else {
                    alert("বার্তা প্রদান বাতিল করা হয়েছে");
                    return;
                  }
                } else {
                  if (confirm(msg)) {
                    main(creator, creation, sender, tags, pagename, multiple);
                  } else {
                    alert("বার্তা প্রদান বাতিল করা হয়েছে");
                    return;
                  }
                }
              } else {
                alert("এই পাতাটিতে কোনো ট্যাগ পাওয়া যায়নি");
                return;
              }
            });
            // all tags recieved successfully
          });
        });
      });
    }
    //choise message for the user based on the tags
    function choiseMsg(tags, multiple, creator, creation, pagename, sender) {
      var strObj = {
        string: "",
        problems: tags,
        problemDes: "",
        multiple: multiple ?? false,
        suggesition: "",
        color: "black",
        days: 0,
        creator: ipCheck(creator) ? "ব্যবহারকারী" : creator,
      };
      //if there is tags
      if (typeof strObj.problems !== "string") {
        strObj.problemDes = problemDes[strObj.problems[0]].des;
        strObj.suggesition = problemDes[strObj.problems[0]].soln
          ? "|suggesition=" + problemDes[strObj.problems[0]].soln
          : "";
        for (var i = 1; i < tags.length; i++) {
          strObj.suggesition += problemDes[strObj.problems[i]].soln
            ? "\n#" + problemDes[strObj.problems[i]].soln
            : "";
          strObj.problemDes += "\n#" + problemDes[strObj.problems[i]].des;
        }
        if (tags && pagename && creator && creation && sender) {
          //counting on date
          var creationDate = countDay(creation);
          //if the page is created more than 7 days ago
          if (creationDate.days > 7) {
            strObj.color = "red";
          } else if (creationDate.days > 3) {
            strObj.color = "orange";
          } else {
            strObj.color = "black";
          }
          //creation day count translation
          creationDate.days =
            creationDate.days > 0
              ? '<span style="color:' +
                strObj.color +
                '">' +
                translateNumbers(creationDate.days) +
                " দিন পূর্বে </span>"
              : "দিন";
          console.log(creationDate.days);
          //if the page is created today
          //string operation
          if (typeof strObj.problems === "object") {
            if (!multiple) {
              strObj.string = `<nowiki>{{subst:টেমপ্লেট:বার্তা প্রদান|page=${pagename}|problem=${strObj.problemDes}${strObj.suggesition}|creator=${strObj.creator}|sender=${sender}|days=${creationDate.days}|date=${creationDate.date}|sign=~~~~}}</nowiki>`;
            } else if (multiple === true && tags.length > 1) {
              strObj.string = `<nowiki>{{subst:টেমপ্লেট:বার্তা প্রদান-একাধিক|page=${pagename}|problem=${strObj.problemDes}${strObj.suggesition}|creator=${strObj.creator}|sender=${sender}|days=${creationDate.days}|date=${creationDate.date}|sign=~~~~}}</nowiki>`;
            }
            return strObj.string;
          }
        } else {
          if (!pagename) {
            alert("পাতার নাম পাওয়া যায়নি");
          } else if (!creator) {
            alert("কোনো প্রণেতা পাওয়া যায়নি");
          } else if (!creation) {
            alert("পাতা প্রকাশের সময় পাওয়া যায়নি");
          } else if (!sender) {
            alert("আপনার নাম পাওয়া যায়নি, সম্ভবত আপনি লগ আউট করেছেন");
          } else if (!tags) {
            alert("ট্যাগ সঠিকভাবে আসেনি");
          } else {
            alert("বার্তা প্রদান করা যায়নি");
          }
        }
      } else {
        //if there is no tags
        if (strObj.problems === "একাধিক") {
          strObj.multiple = false;
        } else if (strObj.problems === "কোনো ট্যাগ নেই") {
          alert("কোনো ট্যাগ পাওয়া যায়নি, বার্তা প্রদান করা হয়নি"); //if there is no tags
          return;
        } else {
          return;
        }
      }
    }
    //main function to exicute
    function main(creator, creation, sender, tags, pagename, multiple) {
      //suggestion for the creator
      var rawtext = "";
      rawtext =
        choiseMsg(tags, multiple, creator, creation, pagename, sender) ?? "";
      if (rawtext.trim() !== "") {
        //notify user

        var notifytext =
            "\n\n" + rawtext.replace("<nowiki>", "").replace("</nowiki>", ""),
          //edit summary
          editsummary =
            "[[ব্যবহারকারী:" +
            sender +
            "|" +
            sender +
            "]] [[ব্যবহারকারী:মোহাম্মদ মারুফ/বার্তাপ্রদান|বার্তাপ্রদান]] সরঞ্জামটি ব্যবহার করে [[ব্যবহারকারী:" +
            creator +
            "|" +
            creator +
            "]]কে বার্তা প্রদান করেছেন";
        // if the user is exist
        if (creator) {
          var talkpage = "ব্যবহারকারী আলাপ:" + creator;
          getOldText(talkpage, function (oldtext) {
            var params = {
              action: "edit",
              title: talkpage,
              text: oldtext + notifytext,
              summary: editsummary,
            };
            //edit the talk page
            api.postWithToken("csrf", params).then(function (data) {
              if (data.edit.result === "Success") {
                addToWatchlist(talkpage, function (data) {
                  if (data.error) {
                    alert(
                      "বার্তা প্রদান করা হয়েছে, কিন্তু আপনার নজরতালিকায় যোগ করা যায়নি"
                    );
                  } else {
                    alert("সফলভাবে বার্তা প্রদান করা হয়েছে");
                  }
                });
              } else {
                alert("বার্তা প্রদান করা যায়নি");
              }
            });
          });
        }
      } else {
        alert("বার্তা প্রদান করা যায়নি");
      }
    }
    //counting on date
    function countDay(date) {
      var diff = today - new Date(date);
      var diffdate = new Date(date);
      var monthArray = [
        "জানুয়ারি",
        "ফেব্রুয়ারি",
        "মার্চ",
        "এপ্রিল",
        "মে",
        "জুন",
        "জুলাই",
        "আগস্ট",
        "সেপ্টেম্বর",
        "অক্টোবর",
        "নভেম্বর",
        "ডিসেম্বর",
      ];
      var diffObj = {
        date:
          translateNumbers(diffdate.getDate()) +
          " " +
          monthArray[diffdate.getMonth()] +
          ", " +
          translateNumbers(diffdate.getFullYear()),
        days: Math.floor(diff / (1000 * 60 * 60 * 24)),
      };
      return {
        days: diffObj.days,
        date: diffObj.date,
      };
    }
    //translate english numbers into bengali numbers
    function translateNumbers(number) {
      var num = number.toString();
      var result = "";
      result = num
        .replace(/0/gi, "০")
        .replace(/1/gi, "১")
        .replace(/2/gi, "২")
        .replace(/3/gi, "৩")
        .replace(/4/gi, "৪")
        .replace(/5/gi, "৫")
        .replace(/6/gi, "৬")
        .replace(/7/gi, "৭")
        .replace(/8/gi, "৮")
        .replace(/9/gi, "৯");
      return result;
    }
    //check if the user is an ip
    function ipCheck(creator) {
      var ipv4Regex = /^(\d{1,3}\.){3}\d{1,3}$/;
      var ipv6Regex = /^([0-9a-fA-F]{1,4}:){7}[0-9a-fA-F]{1,4}$/;
      return ipv4Regex.test(creator) || ipv6Regex.test(creator);
    }
    // look out for the page creation
    function creatorLookOut(pagename, callback) {
      var params = {
        action: "query",
        format: "json",
        prop: "revisions",
        titles: pagename,
        formatversion: "2",
        rvprop: "timestamp|user|comment|tags",
        rvlimit: "1",
        rvdir: "newer",
      };
      api
        .get(params)
        .then(function (data) {
          var revision = data.query.pages[0].revisions[0],
            result = {
              creator: revision.user,
              creation: revision.timestamp,
              summary: revision.comment,
              tags: revision.tags,
            };
          callback(result);
        })
        .fail(function (error) {
          console.error(error);
        });
    }
    //get and fillter tags from template
    function fillterTags(pagename, callback) {
      var params = {
        action: "parse",
        page: pagename,
        format: "json",
      };
      api
        .get(params)
        .then(function (data) {
          var data = data.parse.templates;
          var templates = data.map(function (elem) {
            var tempName = elem["*"].replace("টেমপ্লেট:", "");
            return tempName;
          });
          var tags = templates.filter((value) => problems.includes(value));
          if (tags.length !== 0) {
            callback(tags);
          } else {
            callback(false);
          }
        })
        .fail(function (error) {
          console.error(error);
        });
    }
    //user is active or not
    function usrLstContribution(username, callback) {
      var params = {
        action: "query",
        format: "json",
        list: "usercontribs",
        formatversion: "2",
        uclimit: "1",
        ucuser: username,
        ucnamespace: "*",
      };
      api
        .get(params)
        .then(function (data) {
          var lastContribution = data.query.usercontribs[0].timestamp;
          var dateday = countDay(lastContribution);
          var result = {
            date: dateday.date,
            days: dateday.days,
          };
          callback(result);
        })
        .fail(function (error) {
          console.error(error);
        });
    }
    //set watchlist
    function addToWatchlist(page, callback) {
      var date = new Date(today.getTime() + 7 * 24 * 60 * 60 * 1000); //7 days
      var params = {
        action: "watch",
        format: "json",
        titles: page,
        expiry: date.toISOString(),
      };
      api
        .postWithToken("watch", params)
        .done(function (data) {
          callback(data);
        })
        .fail(function (error) {
          console.error(error);
        });
    }
    //get old text
    function getOldText(page, callback) {
      var params = {
        action: "query",
        format: "json",
        titles: page,
        prop: "wikitext",
        formatversion: "2",
      };
      api.get(params).then(function (data) {
        if (data.query.pages[0].missing) {
          delete params.titles;
          params.page = page;
          params.action = "parse";
          createPage(
            page,
            function (data) {
              api
                .get(params)
                .done(function (data) {
                  callback(data.parse.wikitext);
                })
                .fail(function (error) {
                  console.error(error);
                });
            },
            "== বাংলা উইকিপিডিয়ায় আপনাকে স্বাগতম ==\n\n{{" +
              "স্বাগতম/২য় সংস্করণ}} <!-- বার্তা প্রদান সরঞ্জাম কতৃক প্রদানকৃত -->"
          );
        } else {
          delete params.titles;
          params.page = page;
          params.action = "parse";
          api
            .get(params)
            .done(function (data) {
              callback(data.parse.wikitext);
            })
            .fail(function (error) {
              console.error(error);
            });
        }
      });
    }
    //create page
    function createPage(page, callback, pretext) {
      var params = {
        action: "edit",
        createonly: "true",
        format: "json",
        title: page,
        text: pretext ? pretext : "",
        summary: "বার্তা প্রদান সরঞ্জাম প্রয়োজনে পাতা তৈরি করেছে",
      };
      api
        .postWithToken("csrf", params)
        .done(function (data) {
          callback(data);
        })
        .fail(function (error) {
          console.error(error);
          alert(page + " পাতাটি তৈরি করা যায়নি। তাই বার্তা প্রদান করা যায়নি");
        });
    }
  })(jQuery);
});
