let sdlist = {
  S1: {
    title: "অনর্থক পাতা",
    description:
      'উইকিউক্তির নীতির সুস্পষ্ট বিরোধিতায় তৈরি অর্থহীন বিষয়বস্তুসহ পাতা বা একেবারে অসংলগ্ন (যেমন, "বসজস্কস্কস") বা পরীক্ষামূলক পাতা (যেমন, "আমি কি সত্যিই এখানে একটি পৃষ্ঠা তৈরি করতে পারি?") অথবা ধ্বংসপ্রবণতা।',
    cause:
      "উইকিউক্তির নীতির সুস্পষ্ট বিরোধিতায় তৈরি অর্থহীন বিষয়বস্তুসহ পাতা বা একেবারে অসংলগ্ন",
  },
  S2: {
    title: "ইতিমধ্যে অপসারিত",
    description:
      "উইকিউক্তির অপসারণ নীতি অনুসারে অপসারিত বিষয়বস্তু পুনরায় তৈরি করা হয়েছে। এটি সেই সামগ্রীর ক্ষেত্রে প্রযোজ্য নয় যা অপসারণের নীতি অনুসারে মুছে ফেলা হয়নি৷",
    cause:
      "টি ইতিপূর্বে এক বা একাধিক বার অপসারণ করা হয়েছে। বিস্তারিত জানতে [{{" +
      "fullurl:Special:Log|type=delete&page={{" +
      "FULLPAGENAMEE}}}} অপসারণ লগ] দেখুন",
  },
  S3: {
    title: "গৃহস্থালি পরিষ্কারকরণ",
    description:
      "অ-বিতর্কিত রক্ষণাবেক্ষণের কাজগুলো যেমন পৃষ্ঠার ইতিহাসগুলিকে একত্রিত করার জন্য একটি পৃষ্ঠা সাময়িকভাবে মুছে ফেলা বা একটি অ-বিতর্কিত পৃষ্ঠা সরানো যেমন একটি পুনঃনির্দেশকে উল্টানো বা একটি দ্ব্যর্থতাহীন পৃষ্ঠা অপসারণ করা যা শুধুমাত্র একটি নিবন্ধকে নির্দেশ করে।",
    cause:
      "টি সাধারণ গৃহস্থালি পরিষ্কারকরণ ও রক্ষণবেক্ষণের জন্য মুছে ফেলা প্রয়োজন",
  },
  S4: {
    title: "লেখকের অনুরোধ",
    description:
      "যে কোনো পৃষ্ঠার জন্য মূল লেখক দ্বারা মুছে ফেলার অনুরোধ করা হয়েছে, যদি পৃষ্ঠাটি শুধুমাত্র তার লেখক দ্বারা সম্পাদনা করা হয় এবং ভুলবশতঃ তৈরি করা হয়। যদি লেখক পৃষ্ঠাটি ফাঁকা করে দেন, তাহলে এটি মুছে ফেলার অনুরোধ হিসাবে নেওয়া যেতে পারে।",
    cause:
      "টি লেখক নিজেই মুছে ফেলার আবেদন করেছেন এবং তিনি দাবি করেছেন তিনিই এর একমাত্র অবদানকারী",
  },
  S5: {
    title: "পিতৃহীন আলাপ পাতা",
    description:
      "পৃষ্ঠাগুলির আলাপ পাতাগুলি যা বিদ্যমান নেই, যদি না সেগুলিতে অপসারণের আলোচনা থাকে যা অন্য কোথাও লগ করা হয়নি।",
    cause: "পাতাটি কোনো মূল পাতার অংশ নয়",
  },
  V1: {
    title: "কোন উপাদান নেই",
    description:
      'যে ভুক্তিতে বিষয়ের সংশ্লিষ্ট কোনো ভূমিকা বা কোনো উদ্ধৃতি নেই। এতে বিষয় চিহ্নিত করার জন্য পর্যাপ্ত তথ্য নেই। অথবা পাতাটি খুব ছোট (যেমন, "অমুক একজন মজার মানুষ যিনি ফ্যাক্টরি এবং হ্যাসিন্ডা তৈরি করেছেন। এবং তার স্ত্রী দুর্দান্ত।")। পাশাপাশি বিভিন্ন ধরনের ভুক্তি ব্যতীত অন্য পাঠ্য ভুক্তিবিহীন পাঠ্য (বিষয়-নির্দিষ্ট পরিবর্তন ছাড়াই বয়লারপ্লেট টেমপ্লেটের সম্পূর্ণ বা আংশিক কপি, হাইপারলিঙ্ক ছাড়া আর কিছুই নেই, শিরোনামের সহজ পুনঃবিবৃতি এবং/অথবা তার শিরোনাম দ্বারা নাম দেওয়া ব্যক্তি বা গোষ্ঠীর সাথে সঙ্গতি করার চেষ্টা)।',
    cause: "টিতে কোনো ভুক্তি নেই",
  },
  V2: {
    title: "অন্য উইকির বিষয়বস্তু",
    description:
      "নিবন্ধগুলি যা ইতিমধ্যেই ট্রান্সউইকি নিয়মের মাধ্যমে সরানো হয়েছে। (গন্তব্য প্রকল্পের ট্রান্সউইকি করা নিবন্ধের আলাপ পাতায় নিবন্ধটির সম্পাদনা ইতিহাস সঠিকভাবে পোস্ট করা হয়েছে কিনা তা মুছে ফেলার আগে যাচাই করা ভাল।)",
    cause: "টিটি অপর কোনো উইকি প্রকল্পে রয়েছে",
  },
  V3: {
    title: "আক্রমণাত্মক পাতা",
    description:
      "যে প্রবন্ধগুলি বিষয়বস্তুকে অপমানিত করা ছাড়া আর কোন উদ্দেশ্য পূরণ করে না",
    cause:
      "টির অন্য কোনো সত্তাকে অপমান করা বা হুমকি দেওয়া ছাড়া আর কোনো উদ্দেশ্য নেই",
  },
  B1: {
    title: "খালি বিষয়শ্রেণী",
    description:
      "(কমপক্ষে চার দিনের জন্য কোন নিবন্ধ বা উপশ্রেণী নেই) যার একমাত্র বিষয়বস্তুতে মূল বিষয়শ্রেণীর সংযোগ রয়েছে। এটি অপ্রতে আলোচিত বিষয়শ্রেণীর জন্য প্রযোজ্য নয়। যদি বিষয়শ্রেণীটি তুলনামূলকভাবে নতুন না হয়, তবে এটিতে সম্ভবত আগের নিবন্ধগুলিতে রয়েছে এবং সেক্ষেত্রে আরও গবেষণা প্রয়োজন হতে পারে।",
    cause:
      "টিকে নিয়ে কোনরূপ অপসারণ আলোচনা চলছে না অথবা আলোচনা ব্যতিরেকেই এটি খালি হয়েছে এবং এটি কোন পূনঃনির্দেশিত পাতা, দ্ব্যর্থতা নিরসনকারী বিষয়শ্রেণী, নির্বাচিত বিষয়াবলী সম্বলিত বিষয়শ্রেণী অথবা প্রকল্পপাতাসমূহের বিষয়শ্রেণীও নয়।",
  },
  P1: {
    title: "অস্তিত্বহীন পাতায় পুনর্নির্দেশ",
    description:
      "হয়তো এটি অন্য কোন লক্ষ্যে তৈরিকৃত একটি দরকারী পুনর্নির্দেশকারী পাতা হতে পারে। তাই এটিকে সময় নিয়ে অপসারণ করা উচিত।",
    cause: "টি একটি অস্তিত্বহীন পাতায় পুনর্নির্দেশ করছে",
  },
};
let dlist = {
  S6: {
    title: "দ্ব্যর্থহীন কপিরাইট লঙ্ঘন",
    description:
      "এটি এমন টেক্সট পৃষ্ঠাগুলির ক্ষেত্রে প্রযোজ্য যেখানে কপিরাইটযুক্ত উপাদান রয়েছে যেখানে পাবলিক ডোমেইন, ন্যায্য ব্যবহার বা একটি সামঞ্জস্যপূর্ণ বিনামূল্যে লাইসেন্সের কোনও বিশ্বাসযোগ্য দাবি নেই, যেখানে সংরক্ষণের যোগ্য পৃষ্ঠায় কোনও লঙ্ঘনকারী সামগ্রী নেই৷ যদি পৃষ্ঠার অংশগুলি কপিরাইট লঙ্ঘন না হয়, এবং অন্যথায় দ্রুত অপসারণের জন্য যোগ্য না হয়, তাহলে কপিরাইট লঙ্ঘনগুলি সরানো উচিত এবং পৃষ্ঠার ইতিহাস থেকে সংশোধন করা উচিত।",
    cause:
      "টি একটি অলিখিত উৎস থেকে অনুলিপি করা হয়েছে, যাতে উইকিউক্তিরর সাথে সামঞ্জস্যপূর্ণ লাইসেন্স নেই, এবং অবদানকারী ন্যায্য ব্যবহার দাবি করে নি বা অনুমতির বিশ্বাসযোগ্য কোনো প্রমাণ দেন নি",
  },
  V4: {
    title: "অনুল্লেখ্য বিষয়বস্তু",
    description:
      "একটি প্রকৃত ব্যক্তি, লোকের গোষ্ঠী, ব্যান্ড বা ক্লাব সম্পর্কে একটি নিবন্ধ যা তার বিষয়ের গুরুত্ব বা তাৎপর্যকে গুরুত্ব প্রমাণ করে না। যদি দাবীটি বিতর্কিত বা সাম্ভাব্য বিতর্ক সৃষ্টির আশঙ্কা হয়, তাহলে এটিকে অপ্রতে নেওয়া উচিত।",
    cause: "টির বিষয়বস্তু উল্লেখযোগ্য নয়।",
  },
  B2: {
    title: "দ্রুত বিষয়শ্রেণী নামান্তর",
    description: `পুরাতন বিষয়শ্রেণীগুলো যদি নিচের নীতিমালা অনুযায়ী দ্রুত নামান্তরের জন্য দ্রুত নামান্তরের জন্য যোগ্য বিবেচিত হয় (ভুক্তিগুলো আগে নতুন বিষয়শ্রেণীতে যুক্ত করতে হবে):
# বানান/টাইপো সংশোধন (উদাহরণতঃ খলা -> খেলা, (লেখক) -> লেখক), কিন্তু ভারতীয় বা বাংলাদেশী শব্দে পূর্ববর্তী ব্যবহৃত বানান পরিবর্তন করা যাবেনা।
# একবচন থেকে বহুবচনে বা বহুবচন থেকে একবচনে যাওয়া (উদাহরণতঃ লেখক -> লেখকবৃন্দ)।
# "দেশ অনুসারে" বা এইধরণের বিষয়শ্রেণী রীতি ঠিক রাখার জন্য নামান্তর।
# দেশের নামে সংক্ষিপরূপ থেকে পূর্ণরূপে নেওয়া। যেমন: ইউএস থেকে যুক্তরাষ্ট্র।`,
    cause:
      "টি দ্রুত নামান্তর করা প্রয়োজন বলে এক বা একাধিক ব্যক্তি উদ্বেগ প্রকাশ করেছেন",
  },
  B3: {
    title: "টেমপ্লেট বিষয়শ্রেণী",
    description:
      "যদি কোনও বিষয়শ্রেণী কোনও বিশেষ একক টেমপ্লেটের কারণে জনপ্রিয় হয় এবং অন্য অপসারণ নীতিমালা অনুসারে টেমপ্লেটটি অপসারিত হয়, তাহলে বিষয়শ্রেণীটিও কোনও আলোচনা ছাড়াই অপসারিত হবে।",
    cause: "টির মূল টেমপ্লেটটি অপসারিত হয়েছে",
  },
  P2: {
    title: "ব্যবহারকারী পাতায় পুনর্নির্দেশ",
    description:
      'ব্যবহারকারীর পাতা থেকে প্রধান নামস্থানে স্থানন্তর করা হয়েছে, এমন ইতিহাস ছাড়াই তৈরি পুনর্নির্দেশ। (কখনও কখনও নতুন উইকিউক্তিয়ানরা ভুলবশত মূল নামস্থানে ব্যবহারকারীর পাতা তৈরি করে ফেলে। তাদের ইতিহাস সংরক্ষণ করার জন্য "স্থানান্তর" সরঞ্জামটি ব্যবহার করে তাদের ব্যবহারকারী পাতায় পুনর্নির্দেশ করুন এবং পুনর্নির্দেশ মুছে ফেলার আগে এক বা দুই দিন অপেক্ষা করুন)।',
    cause: "টি ব্যবহারকারীর পাতা থেকে প্রধান নামস্থানে তৈরি পুনর্নির্দেশ",
  },
  P3: {
    title: "অসংজ্ঞায়িত নামস্থানে পুনর্নির্দেশ",
    description:
      "হয়তো বানান ভুলের কারণে এরূপ পাতা তৈরি হতে পারে, যা আদতে দরকারি পাতা।",
    cause: "টি অসংজ্ঞায়িত একটি নামস্থানে পুনর্নির্দেশ তৈরি করেছে",
  },
  U1: {
    title: "ব্যবহারকারীর অনুরোধ",
    description:
      'ব্যবহারকারীরা তাদের নিজস্ব ব্যক্তিগত ব্যবহারকারী পাতা বা উপপাতাগুলো মুছে ফেলার অনুরোধ করে থাকলে৷ ব্যবহারকারী পাতা এবং উপপাতা দেখার সাথেসাথে মুছে ফেলা যেতে পারে; আলাপ পাতাগুলো দেখার সাথেসাথে মুছে ফেলা হবেনা এবং ১৫ দিনের "অপসারণের প্রস্তাবনা" প্রক্রিয়ার মধ্য দিয়ে যেতে হবে।',
    cause: "টি ব্যবহারকারী নিজেই মুছে ফেলতে আবেদন করেছেন",
  },
  T1: {
    title: "আক্রমণাত্মক টেমপ্লেট",
    description:
      "কোনও ব্যক্তি বা গোষ্ঠীকে উদ্দেশ্য করে আক্রমণাত্মক বা অশ্রদ্ধামূলক টেমপ্লেটসমূহ।",
    cause: "টি একটি আক্রমণাত্মক টেমপ্লেট",
  },
};
let totalList = {
  N0: ["S1", "S2", "S3", "S4", "S5", "S6", "V1", "V2", "V3", "V4"],
  N14: ["B1", "B2", "B3", "P1", "P2", "P3"],
  N2: ["U1"],
  N10: ["T1"],
};
let;
